{
  "name": "Achref SOUA",
  "role": "AI Engineer",
  "location": "Saint-Étienne, France",
  "summary": "Versatile AI engineer with proven expertise in generative AI, medical imaging, NLP, time series analysis, and computer vision. Skilled across the full project lifecycle from prototype to production deployment. Currently developing precision medicine platforms for cardiovascular interventions at PrediSurge. Passionate about building impactful, production-ready systems that solve real-world problems.",
  "contact":{
    "email":"achrefsoua10@email.com",
    "phone":"+33 07 51 051375",
    "github":"https://github.com/achref-soua",
    "linkedin":"https://www.linkedin.com/in/achrefsoua"
  },
  "experience":[
    {
      "company":"PrediSurge",
      "role":"AI Engineer — Medical Imaging & Geometry",
      "location":"Saint-Étienne, France",
      "range":"Jan 2025 – Present",
      "summary":"Developing precision medicine platform for cardiovascular interventions. Work on multi-label segmentation of arterial and cardiac structures from pre-operative imaging, 3D mesh construction and geometric measurements for surgical planning. Creating patient-specific digital twins and numerical models simulating biomechanical behavior of arteries and cardiac valves.",
      "details":"• Multi-label segmentation: Segment complex cardiovascular anatomy (aorta, branches, cardiac valves) from CT/MRI imaging\n• 3D Mesh Generation: Construct high-quality meshes from segmentation masks for finite element analysis\n• Geometric Analysis: Compute critical measurements (diameters, angles, volumes) for surgical planning\n• Clinical Collaboration: Work closely with physicians and Medtech companies to validate tools for procedure planning\n• Impact: Enable safer endovascular procedures through improved pre-operative planning and device design"
    },
    {
      "company":"Moovto",
      "role":"LLMs Engineer",
      "location":"Paris, France",
      "range":"Jan 2025 – Feb 2025",
      "summary":"Built a FinOps multi-agent assistant with LangGraph for modular cost analysis and financial optimization. Improved long-term memory for multi-turn financial dialogues and deployed services on AWS using Lambda, S3 and Bedrock with CI/CD.",
      "details":"• Multi-Agent Architecture: Designed modular system with LangGraph for cost analysis, optimization recommendations, and budget planning\n• Long-Term Memory: Optimized memory management for 50+ turn conversations about financial workflows\n• LLM Integration: Leveraged Claude/GPT-4 APIs with custom prompting for financial domain accuracy\n• AWS Deployment: Deployed using Lambda, S3, Bedrock with auto-scaling capabilities\n• Cost Optimization: Reduced API costs by 30% through prompt optimization and caching strategies"
    },
    {
      "company":"Intellect Core Advisory and Solutions SARL",
      "role":"AI Engineer",
      "location":"Grombalia, Tunisia",
      "range":"Nov 2023 – Dec 2024",
      "summary":"Developed LLM-based solutions and RAG architectures using LangChain. Orchestrated enterprise chatbot deployments on AWS (Lambda, Bedrock) optimizing workflows and results.",
      "details":"• RAG Architecture: Designed retrieval-augmented generation systems for domain-specific knowledge integration\n• LangChain Integration: Built LLM pipelines with vector databases and prompt optimization\n• Enterprise Chatbots: Deployed production-ready conversational systems for business process automation\n• AWS Services: Leveraged Lambda, Bedrock, and other AWS services for scalable deployments\n• Performance: Achieved 90%+ user satisfaction on enterprise chatbot implementations"
    },
    {
      "company":"Bionic Soul",
      "role":"Research Engineer — Embedded Systems & ML",
      "location":"Sousse, Tunisia",
      "range":"Nov 2023 – Dec 2024",
      "summary":"Designed an embedded gait analysis system using Arduino Nano 33 and IMU sensors. Used denoising autoencoders and deep learning (GRU, LSTM, Transformers) for knee-angle prediction, improving prediction quality by ~20%.",
      "details":"• Hardware Integration: Interfaced Arduino Nano 33 IoT with MPU-9250 IMU sensors for real-time motion capture\n• Signal Processing: Implemented sensor fusion algorithms combining accelerometer, gyroscope, and magnetometer data\n• Denoising: Built denoising autoencoders to remove sensor noise and improve signal quality (+20% accuracy improvement)\n• Deep Learning: Implemented GRU, LSTM, and Transformer architectures for time series prediction of knee angles\n• Hyperparameter Optimization: Used Optuna and GridSearchCV with Weights & Biases for tracking and reproducibility"
    }
  ],
  "education":[
    {"institution":"École Supérieure Privée d'Ingénierie et de Technologies (ESPRIT)","degree":"Engineering Degree in Computer Science, AI","range":"Sept 2020 – Aug 2023","location":"Tunis, Tunisia"},
    {"institution":"Faculty of Sciences of Monastir","degree":"Preparatory cycle — Physics-Chemistry","range":"Sept 2018 – Jul 2020","location":"Monastir, Tunisia"}
  ],
  "skills":[
    "Python","R","C++","SQL","TensorFlow","PyTorch","Keras","Hugging Face Transformers","NumPy","Pandas","Scikit-learn","OpenCV","LangChain","LangGraph","FastAPI","AWS","Azure","Docker","Kubernetes","CI/CD","MLOps","Medical Imaging","Segmentation","3D Reconstruction","PyRadiomics","Arduino","Embedded Systems","Optuna","Weights & Biases","Git","Jira","Confluence"
  ],
  "publications":[
    {"citation":"Soua, A., Charfi, B., & Riahi, M. H. (2024). Improved Bionic Leg with AI.","venue":"10th Int. Conf. on Green Energy & Environmental Engineering (GEEE-2024)","year":"2024"}
  ]
}
