{
  "name": "Achref SOUA",
  "role": "Data Scientist",
  "location": "Paris, France",
  "summary": "Data Scientist spécialisé LLMs et IA générative avec 2 ans d'expérience en modèles de langage, NLP avancé et applications génératives. Expert du développement de pipelines LLM de bout en bout, du prototypage à la mise en production. Curieux, autonome et orienté impact, je conçois des solutions IA robustes et scalables pour résoudre des problèmes métiers complexes.",
  "contact":{
    "email":"achref.soua@outlook.com",
    "phone":"7 51 05 13 75",
    "github":"https://github.com/achref-soua",
    "linkedin":"https://www.linkedin.com/in/achref-soua/"
  },
  "experience": [
    {
      "company": "Moovto",
      "role": "Data Scientist",
      "location": "Paris, France",
      "range": "Jan 2025 – Present",
      "summary": "Développement d'un assistant FinOps multi-agent avancé avec LLaMA 3 pour analyses modulaires des coûts. Optimisation de la mémoire longue pour dialogues multi-tours, amélioration de la cohérence de 23%. Déploiement sur AWS (Lambda, S3, Bedrock) avec pipelines CI/CD, assurant scalabilité et haute fiabilité.",
      "details": "• Multi-Agent Architecture: Conception d'un système modulaire avec LangGraph et LLaMA 3 pour analyse et recommandations de coûts\n• Mémoire Longue: Optimisation de la gestion de mémoire pour conversations multi-tours (+23% cohérence)\n• Intégration LLaMA 3: Utilisation de LLaMA 3 avec prompting personnalisé pour le domaine financier\n• Déploiement AWS: Lambda, S3, Bedrock avec auto-scaling et pipelines CI/CD\n• Performance: Haute fiabilité et scalabilité en production"
    },
    {
      "company": "Intellect Core Advisory and Solutions SARL",
      "role": "Data Scientist",
      "location": "Grombalia, Tunisia",
      "range": "Nov 2023 – Dec 2024",
      "summary": "Création complète d'une base de données vectorielle et développement d'un chatbot RAG avec LLMs et LangChain. Intégration de modèles open-source (LLaMA 2, LeoLM) et propriétaires (GPT-4, Mistral). Déploiement serverless AWS (Lambda, S3, Bedrock) avec workflows de recherche vectorielle scalables.",
      "details": "• Base Vectorielle: Conception et implémentation d'une base vectorielle complète avec LangChain\n• Intégration LLMs: Intégration de LLaMA 2, LeoLM, GPT-4 et Mistral\n• Chatbot RAG: Développement d'un système conversationnel prêt pour la production\n• Déploiement Serverless: AWS Lambda, S3, Bedrock avec recherche vectorielle scalable\n• Optimisation: Amélioration des interactions par prompt engineering et tuning"
    }
  ],
  "education":[
    {"institution":"École Supérieure Privée d'Ingénierie et de Technologies (ESPRIT)","degree":"Engineering Degree in Computer Science, AI","range":"Sept 2020 – Aug 2023","location":"Tunis, Tunisia"},
    {"institution":"Faculty of Sciences of Monastir","degree":"Preparatory cycle — Physics-Chemistry","range":"Sept 2018 – Jul 2020","location":"Monastir, Tunisia"}
  ],
  "skills":[
    "Python","R","SQL","TensorFlow","PyTorch","Hugging Face Transformers","NumPy","Pandas","Scikit-learn","LangChain","LangGraph","FastAPI","AWS","Docker","Kubernetes","CI/CD","MLOps","LLMs","LLaMA 3","GPT-4","Mistral","Prompt Engineering","Embeddings","Vector Databases","Streamlit","ReportLab","Groq API","Git"
  ],
  "publications":[
    {"citation":"Soua, A., Charfi, B., & Riahi, M. H. (2024). Improved Bionic Leg with AI.","venue":"10th Int. Conf. on Green Energy & Environmental Engineering (GEEE-2024)","year":"2024"}
  ]
}
