{
  "name": "Achref SOUA",
  "role": "Data Scientist",
  "location": "Saint Etienne, France",
  "summary": "Data Scientist with 2 years of experience in language models, and computer vision. Expert in developing end-to-end LLM pipelines from prototyping to production. Curious, autonomous, and impact-driven, I design robust and scalable AI solutions to solve complex business problems.",
  "contact":{
    "email":"achref.soua@outlook.com",
    
    "github":"https://github.com/achref-soua",
    "linkedin":"https://www.linkedin.com/in/achref-soua/"
  },
  "experience": [
    {
      "company": "PrediSurge",
      "role": "Data Scientist",
      "location": "Saint Etienne, France",
      "range": "Oct 2025 – Present",
      "summary": "Developing advanced medical imaging solutions for cardiovascular interventions. Working on multi-label segmentation of arterial and cardiac structures, 3D mesh generation and calculations for surgical planning, optimizing data pipelines and processing workflows to support precision medicine initiatives.",
      "details": "• Multi-Label Segmentation: Segment complex cardiovascular anatomy (aorta, branches, cardiac structures) from CT/MRI imaging\n• 3D Modelling and Mesh Calculations: Generate and refine 3D meshes from segmentation masks, computing geometric measurements for surgical planning\n• Data Operations and Workflows: Optimize ETL pipelines for medical imaging data processing and quality assurance\n• Data Processing: Implement robust data validation, normalization, and storage workflows for medical datasets\n• Clinical Collaboration: Work with physicians and medical device companies to validate tools and ensure clinical relevance"
    },
    {
      "company": "Moovto",
      "role": "Data Scientist",
      "location": "Paris, France",
      "range": "Jan 2025 – Aug 2025",
      "summary": "Developing an advanced multi-agent FinOps assistant with LLaMA 3 for modular cost analysis. Optimized long-term memory for multi-turn dialogues, improving coherence by 23%. Deployed on AWS (Lambda, S3, Bedrock) with CI/CD pipelines ensuring scalability and high reliability.",
      "details": "• Multi-Agent Architecture: Designed modular system with LangGraph and LLaMA 3 for cost analysis and optimization recommendations\n• Long-Term Memory: Optimized memory management for multi-turn conversations with 23% coherence improvement\n• LLaMA 3 Integration: Leveraged LLaMA 3 with custom prompting for financial domain expertise\n• AWS Deployment: Lambda, S3, Bedrock with auto-scaling and CI/CD pipelines\n• Performance: High reliability and scalability in production environments"
    },
    {
      "company": "Intellect Core Advisory and Solutions SARL",
      "role": "Data Scientist",
      "location": "Grombalia, Tunisia",
      "range": "Nov 2023 – Dec 2024",
      "summary": "Complete creation of vector database and development of RAG chatbot with LLMs and LangChain. Integration of open-source (LLaMA 2, LeoLM) and proprietary models (GPT-4, Mistral). Serverless AWS deployment (Lambda, S3, Bedrock) with scalable vector search workflows.",
      "details": "• Vector Database: Designed and implemented complete vector database with LangChain\n• LLM Integration: Integrated LLaMA 2, LeoLM, GPT-4, and Mistral models\n• RAG Chatbot: Developed production-ready conversational system\n• Serverless Deployment: AWS Lambda, S3, Bedrock with scalable vector search\n• Optimization: Improved interactions through prompt engineering and tuning"
    }
  ],
  "education":[
    {"institution":"ESPRIT (École Supérieure Privée d'Ingénierie et de Technologies)","degree":"Engineering Degree in Computer Science, AI","range":"Sept 2020 – Aug 2023","location":"Tunis, Tunisia"},
    {"institution":"Faculty of Sciences of Monastir","degree":"Preparatory cycle – Physics and Chemistry","range":"Sept 2018 – Jul 2020","location":"Monastir, Tunisia"}
  ],
  "skills":[
    "Python","R","SQL","TensorFlow","PyTorch","Hugging Face Transformers","NumPy","Pandas","Scikit-learn","LangChain","LangGraph","FastAPI","AWS","Docker","Kubernetes","CI/CD","MLOps","LLMs","LLaMA 3","GPT-4","Mistral","Prompt Engineering","Embeddings","Vector Databases","Streamlit","ReportLab","Groq API","Git"
  ],
  "publications":[
    {"citation":"Soua, A., Charfi, B., & Riahi, M. H. (2024). Improved Bionic Leg with AI.","venue":"10th Int. Conf. on Green Energy & Environmental Engineering (GEEE-2024)","year":"2024"}
  ]
}
